Revit 2026 API

# SurfaceDistributionRebarHandles Enumeration

---

This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Surface Distribution has. The tag of a [!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle can be obtained by calling the [!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SurfaceDistributionRebarHandles
```
```vb
Public Enumeration SurfaceDistributionRebarHandles
```
```cpp
public enum class SurfaceDistributionRebarHandles
```
```fsharp
type SurfaceDistributionRebarHandles
```

| Member name | Value | Description |
| --- | --- | --- |
| EndSurface | 2 | Tag for handle representing the End Surface. |
| HostSurface | 0 | Tag for handle representing the Host Surface. |
| StartSurface | 1 | Tag for handle representing the Start Surface. |

#### Reference

Autodesk.Revit.DB.Structure Namespace